public/sysbench-tidesql-v4-5-6-innodb-mariadb-v11-8-6-tidesdb-v9.3.6/tidesdb_oltp_read_write_run2.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 1644.57 qps: 32909.07 (r/w/o: 23040.06/6578.28/3290.74) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 1501.90 qps: 30037.98 (r/w/o: 21026.38/6007.80/3003.80) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 1567.03 qps: 31353.28 (r/w/o: 21944.91/6274.32/3134.06) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 1730.13 qps: 34589.98 (r/w/o: 24215.47/6914.24/3460.27) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 1984.20 qps: 39683.63 (r/w/o: 27778.15/7937.09/3968.39) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 1940.49 qps: 38809.92 (r/w/o: 27167.07/7761.86/3880.98) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 1993.80 qps: 39875.41 (r/w/o: 27912.74/7975.18/3987.49) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 1941.21 qps: 38824.10 (r/w/o: 27176.27/7765.32/3882.51) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 1487.51 qps: 29751.80 (r/w/o: 20827.07/5949.62/2975.11) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 1289.39 qps: 25787.29 (r/w/o: 18050.92/5157.68/2578.69) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 1520.94 qps: 30417.89 (r/w/o: 21292.42/6083.58/3041.89) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 1487.81 qps: 29757.32 (r/w/o: 20830.26/5951.44/2975.62) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2812712
        write:                           803632
        other:                           401816
        total:                           4018160
    transactions:                        200908 (1674.06 per sec.)
    queries:                             4018160 (33481.18 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1674.0590
    time elapsed:                        120.0125s
    total number of events:              200908

Latency (ms):
         min:                                    3.22
         avg:                                    9.55
         max:                                  374.11
         95th percentile:                       17.63
         sum:                              1919157.45

Threads fairness:
    events (avg/stddev):           12556.7500/211.82
    execution time (avg/stddev):   119.9473/0.01