public/sysbench-tidesql-v4-5-6-innodb-mariadb-v11-8-6-tidesdb-v9.3.6/tidesdb_oltp_update_index_run1.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 41259.73 qps: 41259.73 (r/w/o: 0.00/41259.73/0.00) lat (ms,95%): 0.69 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 38295.94 qps: 38296.04 (r/w/o: 0.00/38296.04/0.00) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 35873.35 qps: 35873.25 (r/w/o: 0.00/35873.25/0.00) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 31024.93 qps: 31024.93 (r/w/o: 0.00/31024.93/0.00) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 35914.96 qps: 35914.96 (r/w/o: 0.00/35914.96/0.00) lat (ms,95%): 0.74 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 37738.02 qps: 37738.02 (r/w/o: 0.00/37738.02/0.00) lat (ms,95%): 0.78 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 36094.29 qps: 36094.29 (r/w/o: 0.00/36094.29/0.00) lat (ms,95%): 0.84 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 34534.02 qps: 34534.02 (r/w/o: 0.00/34534.02/0.00) lat (ms,95%): 0.84 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 33957.96 qps: 33957.96 (r/w/o: 0.00/33957.96/0.00) lat (ms,95%): 0.78 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 32622.67 qps: 32622.67 (r/w/o: 0.00/32622.67/0.00) lat (ms,95%): 0.77 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 36712.03 qps: 36712.03 (r/w/o: 0.00/36712.03/0.00) lat (ms,95%): 0.83 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 36382.85 qps: 36382.85 (r/w/o: 0.00/36382.85/0.00) lat (ms,95%): 0.72 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           4304187
        other:                           0
        total:                           4304187
    transactions:                        4304187 (35867.59 per sec.)
    queries:                             4304187 (35867.59 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      35867.5875
    time elapsed:                        120.0021s
    total number of events:              4304187

Latency (ms):
         min:                                    0.04
         avg:                                    0.45
         max:                                  642.92
         95th percentile:                        0.78
         sum:                              1916413.56

Threads fairness:
    events (avg/stddev):           269011.6875/3123.64
    execution time (avg/stddev):   119.7758/0.01